Show / Hide Table of Contents
Class ConversionDictionaryString
Inheritance
System.Object
System.Collections.Generic.Dictionary<System.String, System.Int32>
SerializableDictionary<System.String, System.Int32>
ConversionDictionary<System.String>
ConversionDictionaryString
Implements
System.Collections.Generic.IDictionary<System.String, System.Int32>
System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<System.String, System.Int32>>
System.Collections.IDictionary
System.Collections.ICollection
System.Collections.Generic.IReadOnlyDictionary<System.String, System.Int32>
System.Collections.Generic.IReadOnlyCollection<System.Collections.Generic.KeyValuePair<System.String, System.Int32>>
System.Collections.Generic.IEnumerable<System.Collections.Generic.KeyValuePair<System.String, System.Int32>>
System.Collections.IEnumerable
System.Runtime.Serialization.IDeserializationCallback
System.Xml.Serialization.IXmlSerializable
System.Runtime.Serialization.ISerializable
Inherited Members
 ConversionDictionary<String>.Merge(IList<ProjectItem>)
 ConversionDictionary<String>.InitMerge(IList<ProjectItem>)
 ConversionDictionary<String>.MapId(String)
 ConversionDictionary<String>.GetExEntityId(String)
 SerializableDictionary<String, Int32>.ISerializable.GetObjectData(SerializationInfo, StreamingContext)
 SerializableDictionary<String, Int32>.IXmlSerializable.WriteXml(XmlWriter)
 SerializableDictionary<String, Int32>.IXmlSerializable.ReadXml(XmlReader)
 SerializableDictionary<String, Int32>.IXmlSerializable.GetSchema()
 SerializableDictionary<String, Int32>.ValueSerializer
 System.Collections.Generic.Dictionary<System.String, System.Int32>.Add(System.String, System.Int32)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<System.String, System.Int32>>.Add(System.Collections.Generic.KeyValuePair<System.String, System.Int32>)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<System.String, System.Int32>>.Contains(System.Collections.Generic.KeyValuePair<System.String, System.Int32>)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<System.String, System.Int32>>.Remove(System.Collections.Generic.KeyValuePair<System.String, System.Int32>)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.Clear()
 System.Collections.Generic.Dictionary<System.String, System.Int32>.ContainsKey(System.String)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.ContainsValue(System.Int32)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.GetEnumerator()
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.Generic.IEnumerable<System.Collections.Generic.KeyValuePair<System.String, System.Int32>>.GetEnumerator()
 System.Collections.Generic.Dictionary<System.String, System.Int32>.GetObjectData(System.Runtime.Serialization.SerializationInfo, System.Runtime.Serialization.StreamingContext)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.OnDeserialization(System.Object)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.Remove(System.String)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.TryGetValue(System.String, System.Int32)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<System.String, System.Int32>>.CopyTo(System.Collections.Generic.KeyValuePair<System.String, System.Int32>[], System.Int32)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.ICollection.CopyTo(System.Array, System.Int32)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IEnumerable.GetEnumerator()
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IDictionary.get_Item(System.Object)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IDictionary.set_Item(System.Object, System.Object)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IDictionary.Add(System.Object, System.Object)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IDictionary.Contains(System.Object)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IDictionary.GetEnumerator()
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IDictionary.Remove(System.Object)
 System.Collections.Generic.Dictionary<System.String, System.Int32>.Comparer
 System.Collections.Generic.Dictionary<System.String, System.Int32>.Count
 System.Collections.Generic.Dictionary<System.String, System.Int32>.Keys
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.Generic.IDictionary<System.String, System.Int32>.Keys
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.Generic.IReadOnlyDictionary<System.String, System.Int32>.Keys
 System.Collections.Generic.Dictionary<System.String, System.Int32>.Values
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.Generic.IDictionary<System.String, System.Int32>.Values
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.Generic.IReadOnlyDictionary<System.String, System.Int32>.Values
 System.Collections.Generic.Dictionary<System.String, System.Int32>.Item[System.String]
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<System.String, System.Int32>>.IsReadOnly
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.ICollection.IsSynchronized
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.ICollection.SyncRoot
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IDictionary.IsFixedSize
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IDictionary.IsReadOnly
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IDictionary.Keys
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IDictionary.Values
 System.Collections.Generic.Dictionary<System.String, System.Int32>.System.Collections.IDictionary.Item[System.Object]
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public sealed class ConversionDictionaryString : ConversionDictionary<string>, IDictionary<string, int>, ICollection<KeyValuePair<string, int>>, IDictionary, ICollection, IReadOnlyDictionary<string, int>, IReadOnlyCollection<KeyValuePair<string, int>>, IEnumerable<KeyValuePair<string, int>>, IEnumerable, IDeserializationCallback, IXmlSerializable, ISerializable
Methods
Improve this Doc   View Source
GetKey(Int32)
Declaration
protected override string GetKey(int id)
Parameters
 Type |  Name |  Description
 System.Int32 |  id
Returns
 Type |  Description
 System.String
Overrides
IdeaStatiCa.Plugin.ConversionDictionary<System.String>.GetKey(System.Int32)
Improve this Doc   View Source
GetKey(String)
Declaration
protected override string GetKey(string name)
Parameters
 Type |  Name |  Description
 System.String |  name
Returns
 Type |  Description
 System.String
Overrides
IdeaStatiCa.Plugin.ConversionDictionary<System.String>.GetKey(System.String)
Improve this Doc   View Source
GetSaveKey(Int32)
Declaration
public override string GetSaveKey(int Id)
Parameters
 Type |  Name |  Description
 System.Int32 |  Id
Returns
 Type |  Description
 System.String
Overrides
IdeaStatiCa.Plugin.ConversionDictionary<System.String>.GetSaveKey(System.Int32)
Implements
 System.Collections.Generic.IDictionary<TKey, TValue>
 System.Collections.Generic.ICollection<T>
 System.Collections.IDictionary
 System.Collections.ICollection
 System.Collections.Generic.IReadOnlyDictionary<TKey, TValue>
 System.Collections.Generic.IReadOnlyCollection<T>
 System.Collections.Generic.IEnumerable<T>
 System.Collections.IEnumerable
 System.Runtime.Serialization.IDeserializationCallback
 System.Xml.Serialization.IXmlSerializable
 System.Runtime.Serialization.ISerializable
 Improve this Doc
 View Source